tap "cyberark/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "ms526/local"
tap "powershell/tap"
brew "azure-cli"
brew "chezmoi"
brew "circleci"
brew "django-completion"
brew "dos2unix"
brew "duti"
brew "eslint"
brew "gcc@11"
brew "git"
brew "kube-linter"
brew "kustomize"
brew "mas"
brew "node@20"
brew "openshift-cli"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "wget"
brew "zlib"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "cyberark/tools/conjur-cli"
brew "ms526/local/libxmlsec1@1.2.37"
brew "powershell/tap/powershell"
cask "1password-cli"
cask "apache-directory-studio"
cask "dash"
cask "dbeaver-community"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "roam-research"
cask "snowflake-snowsql"
cask "tidal"
cask "visual-studio-code"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Evernote", id: 406056744
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "KubeContext", id: 1438838068
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
vscode "batisteo.vscode-django"
vscode "circleci.circleci"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "hiro-sun.vscode-emacs"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "rashwell.tcl"
vscode "redhat.vscode-yaml"
vscode "shamanu4.django-intellisense"
vscode "snowflake.snowflake-vsc"
vscode "stkb.rewrap"
